app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-06 11:59:19.991356"], ["description", "a description for task"], ["updated_at", "2014-11-06 11:59:19.991356"]]

  def destroy
    @task = Task.find(params[:id])

    if @task.destroy
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]

  def show
    @task = Task.find params[:id]
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 15]]